Repository: kaarkadiusz/KomponentyDemos
Catalog: Pages/Button/ButtonPageResources.*.resx
Languages: pl

# ColorDescription
source: Use the <span class="parameter">Color</span> parameter to change the color of the button.
pl: Użyj parametru <span class="parameter">Color</span>, aby zmienić kolor przycisku.

# ColorTitle
source: Color
pl: Kolor

# SizeDescription
source: Use the <span class="parameter">Size</span> parameter to change the size of the button.
pl: Użyj parametru <span class="parameter">Size</span>, aby zmienić rozmiar przycisku.

# SizeTitle
source: Size
pl: Rozmiar

# BasicExampleDescription
source: Use the <span class="component">KAButton</span> component to render a standard HTML button tag that contains a number of commonly used parameters.
pl: Użyj komponentu <span class="component">KAButton</span>, aby wyrenderować standardowy tag przycisku HTML, który zawiera szereg często używanych parametrów.

# TypeTitle
source: Type
pl: Typ

# TypeDescription
source: Use the <span class="parameter">Type</span> parameter to change the variant of the button.
pl: Użyj parametru <span class="parameter">Type</span>, aby zmienić wariant przycisku.

# IconsTitle
source: Icons
pl: Ikony

# IconsDescription1
source: Use the <span class="parameter">StartIcon</span> and <span class="parameter">EndIcon</span> parameters to set the icons that appear before and after the button's text. You can use either one of them or both at the same time.
pl: Użyj parametrów <span class="parameter">StartIcon</span> i <span class="parameter">EndIcon</span>, aby ustawić ikony wyświetlane przed i po tekście przycisku. Możesz użyć jednego z nich lub obu jednocześnie.

# IconsDescription2
source: The value you provide is passed on to the <span class="component">KAIcon</span> component, so it follows the same rules that apply for that parameter in that component.
pl: Podana wartość jest przekazywana do komponentu <span class="component">KAIcon</span>, więc obowiązują ją te same zasady, które mają zastosowanie do tego parametru w tym komponencie.

# TypeAttributeRemark
source: By default, the <span class="component">KAButton</span> component sets the value of <span class="attribute">type</span> attribute to <span class="value">button</span> value. One may change it by simply setting the attribute like any other component parameter.
pl: Domyślnie komponent <span class="component">KAButton</span> ustawia wartość atrybutu <span class="attribute">type</span> na wartość <span class="value">button</span>. Można go zmienić, ustawiając atrybut tak samo jak każdy inny parametr komponentu.

# IconButtonTitle
source: Icon button
pl: Przycisk z ikoną

# IconButtonDescription
source: You may set only one of the icons to render an icon button.
pl: Możesz ustawić tylko jedną z ikon, aby wyświetlić przycisk z ikoną.

# ButtonGroupDescription
source: Use the <span class="component">KAButtonGroup</span> wrapper to create a group of buttons.
pl: Użyj opakowania <span class="component">KAButtonGroup</span>, aby utworzyć grupę przycisków.

# ButtonGroupOverridesDescription
source: By default, <span class="component">KAButtonGroup</span> wrapper doesn't force the buttons to conform to a single style setting. However one may set <span class="parameter">Color</span>, <span class="parameter">Size</span> or <span class="parameter">Type</span> parameters to forcefully override the individual button styles.
pl: Domyślnie opakowanie <span class="component">KAButtonGroup</span> nie wymusza na przyciskach zgodności z jednym ustawieniem stylu. Można jednak ustawić parametry <span class="parameter">Color</span>, <span class="parameter">Size</span> lub <span class="parameter">Type</span>, aby wymusić nadpisanie indywidualnych stylów przycisków.

# ButtonGroupDirectionDescription
source: Use the <span class="parameter">Direction</span> parameter to switch between displaying group in a row or in a column.
pl: Użyj parametru <span class="parameter">Direction</span>, aby przełączać się między wyświetlaniem grupy w wierszu lub w kolumnie.

# ButtonGroupDirectionTitle
source: Direction
pl: Kierunek

# ButtonGroupOverridesTitle
source: Overrides
pl: Nadpisania
